src/InformationRegisters/ИТСервисы_НастройкиИнтеграцииKaiten/ИТСервисы_НастройкиИнтеграцииKaiten.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_НастройкиИнтеграцииKaiten</name>
  <resources>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>KaitenBoardID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>KaitenLaneID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>KaitenQueueColumnID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>KaitenInProgressColumnID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>KaitenReviewColumnID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>KaitenDoneColumnID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>KaitenCanceledColumnID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>PriorityPropertyID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>PlanHoursPropertyID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FactHoursPropertyID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ProjectPropertyID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>StartDatePropertyID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>EndDatePropertyID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ExternalSystemCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ИТСервисы_СтатусыЗадач/ИТСервисы_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_СтатусыЗадач</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>НаПроверке</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ИТСервисы_ПриоритетыЗадач/ИТСервисы_ПриоритетыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_ПриоритетыЗадач</name>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Критический</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ИТСервисы_Задачи/ИТСервисы_Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_Задачи</name>
  <registerRecords>InformationRegister.ИТСервисы_СостоянияЗадач</registerRecords>
  <registerRecords>AccumulationRegister.ИТСервисы_НагрузкаСотрудникаПоЗадачам</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ИТСервисы_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнтеграционныйКонтур</name>
    <attributes>
      <name>UUIDСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KaitenID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KaitenCardURL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененПослеСинхронизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнейСинхронизации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийСтатус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ИТСервисы_Проекты/ИТСервисы_Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_Проекты</name>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПространствоKaiten</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТребованияККоманде</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемыйГрейд</name>
      <type>
        <types>EnumRef.ИТСервисы_Грейды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательнаяКомпетенция</name>
      <type>
        <types>CatalogRef.ИТСервисы_Компетенции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ИТСервисы_ИТСервисыИнтеграцияСервер/Module.bsl
Функция ПолучитьГлобальныеНастройкиИнтеграцииKaiten() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("enabled", Константы.ИТСервисы_KaitenIntegrationEnabled.Получить());
	Результат.Вставить("kaiten_base_url", СокрЛП(Константы.ИТСервисы_KaitenBaseUrl.Получить()));
	Результат.Вставить("kaiten_token", СокрЛП(Константы.ИТСервисы_KaitenToken.Получить()));
	Результат.Вставить("python_service_url", СокрЛП(Константы.ИТСервисы_PythonServiceUrl.Получить()));
	Результат.Вставить("sync_interval_minutes", Константы.ИТСервисы_KaitenSyncIntervalMinutes.Получить());

	Возврат Результат;

КонецФункции

Процедура ВыполнитьЗапускСинхронизацииKaiten() Экспорт
	
	URLСервиса = СокрЛП(Константы.ИТСервисы_PythonServiceUrl.Получить());

	Если ПустаяСтрока(URLСервиса) Тогда
		ВызватьИсключение "Не заполнена константа PythonServiceUrl.";
	КонецЕсли;

	ПараметрыURL = РазобратьURL(URLСервиса);

	Попытка
		Соединение = Новый HTTPСоединение(ПараметрыURL.Хост, ПараметрыURL.Порт);
		Запрос = Новый HTTPЗапрос(ПараметрыURL.Путь + "/sync/run");
		Запрос.Заголовки.Вставить("Content-Type", "application/json");
		Запрос.УстановитьТелоИзСтроки("{}", КодировкаТекста.UTF8);

		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();

		Если Ответ.КодСостояния = 200 Тогда
			Возврат;
		ИначеЕсли Ответ.КодСостояния = 409 Тогда
			ВызватьИсключение "Синхронизация уже выполняется.";
		Иначе
			ВызватьИсключение
				"Ошибка запуска синхронизации. Код: "
				+ Строка(Ответ.КодСостояния)
				+ ". Ответ сервиса: "
				+ ТелоОтвета;
		КонецЕсли;

	Исключение
		ВызватьИсключение "Не удалось запустить синхронизацию: " + ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры

Функция РазобратьURL(Знач СтрокаURL) Экспорт

	СтрокаURL = СокрЛП(СтрокаURL);

	Схема = "";
	ПозицияСхемы = Найти(СтрокаURL, "://");
	Если ПозицияСхемы > 0 Тогда
		Схема = НРег(Лев(СтрокаURL, ПозицияСхемы - 1));
		СтрокаURL = Сред(СтрокаURL, ПозицияСхемы + 3);
	КонецЕсли;

	Путь = "";
	ПозицияСлеша = Найти(СтрокаURL, "/");
	Если ПозицияСлеша > 0 Тогда
		СтрокаСоединения = Лев(СтрокаURL, ПозицияСлеша - 1);
		Путь = Сред(СтрокаURL, ПозицияСлеша);
	Иначе
		СтрокаСоединения = СтрокаURL;
		Путь = "";
	КонецЕсли;

	Хост = СтрокаСоединения;
	Порт = 0;

	ПозицияДвоеточия = Найти(СтрокаСоединения, ":");
	Если ПозицияДвоеточия > 0 Тогда
		Хост = Лев(СтрокаСоединения, ПозицияДвоеточия - 1);
		Порт = Число(Сред(СтрокаСоединения, ПозицияДвоеточия + 1));
	Иначе
		Если Схема = "https" Тогда
			Порт = 443;
		Иначе
			Порт = 80;
		КонецЕсли;
	КонецЕсли;

	Возврат Новый Структура("Схема,Хост,Порт,Путь", Схема, Хост, Порт, Путь);

КонецФункции

Функция СформироватьJSONОтвет(КодСостояния, Данные) Экспорт

	Ответ = Новый HTTPСервисОтвет(КодСостояния);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	ТекстJSON = ЗаписьJSON.Закрыть();

	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ТекстJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Возврат Ответ;

КонецФункции


Функция ПрочитатьJSONИзТела(Запрос) Экспорт

	ТекстJSON = Запрос.ПолучитьТелоКакСтроку();

	Если ПустаяСтрока(ТекстJSON) Тогда
		Возврат Новый Структура;
	КонецЕсли;

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();

	Возврат Данные;

КонецФункции


Функция БезопаснаяСтрока(Значение) Экспорт

	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Попытка

		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Возврат "";
		КонецЕсли;

		Результат = СокрЛП(Строка(Значение));

		Если Найти(Результат, "<Объект не найден>") > 0 Тогда
			Возврат "";
		КонецЕсли;

		Возврат Результат;

	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции


Функция ФорматДатаВJSON(ДатаЗначения) Экспорт

	Если НЕ ЗначениеЗаполнено(ДатаЗначения) Тогда
		Возврат "";
	КонецЕсли;

	Возврат Формат(ДатаЗначения, "ДФ='yyyy-MM-ddTHH:mm:ss'");

КонецФункции


Процедура ЗаписатьДокументТехнически(ОбъектДокумента) Экспорт

	ОбъектДокумента.ДополнительныеСвойства.Вставить("ЭтоСлужебнаяЗаписьИнтеграции", Истина);

	Попытка
		Если ОбъектДокумента.Проведен Тогда
			ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектДокумента.Записать();
		КонецЕсли;
	Исключение
		ОбъектДокумента.ДополнительныеСвойства.Вставить("ЭтоСлужебнаяЗаписьИнтеграции", Ложь);
		ВызватьИсключение;
	КонецПопытки;

	ОбъектДокумента.ДополнительныеСвойства.Вставить("ЭтоСлужебнаяЗаписьИнтеграции", Ложь);

КонецПроцедуры


Процедура ЗаписатьДокументСПроведением(ОбъектДокумента) Экспорт

	ЗаписатьДокументТехнически(ОбъектДокумента);

КонецПроцедуры


Функция НужноВыгружатьСтроку(СтрокаЗадачи) Экспорт

	UUIDСтроки = БезопаснаяСтрока(СтрокаЗадачи.UUIDСтроки);
	KaitenID = БезопаснаяСтрока(СтрокаЗадачи.KaitenID);

	Если ПустаяСтрока(UUIDСтроки) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ПустаяСтрока(KaitenID) Тогда
		Возврат Истина;
	КонецЕсли;

	Если СтрокаЗадачи.ИзмененПослеСинхронизации Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

// Исправлено: Параметром теперь выступает ОбъектДокумента
Функция ПолучитьЗаголовокЗадачи(ОбъектДокумента) Экспорт

	Описание = БезопаснаяСтрока(ОбъектДокумента.Описание);

	Если ПустаяСтрока(Описание) Тогда
		Возврат "Задача без названия";
	КонецЕсли;

	Возврат Лев(Описание, 120);

КонецФункции

// Исправлено: Параметром теперь выступает ОбъектДокумента
Процедура ПопытатьсяЗаполнитьСтатус1СИзВнешнегоСтатуса(ОбъектДокумента, ВнешнийСтатус) Экспорт

	ВнешнийСтатус = БезопаснаяСтрока(ВнешнийСтатус);

	Если ПустаяСтрока(ВнешнийСтатус) Тогда
		Возврат;
	КонецЕсли;

	Если ВнешнийСтатус = "Очередь" Или ВнешнийСтатус = "Новая" Тогда
		ОбъектДокумента.Статус = Перечисления.ИТСервисы_СтатусыЗадач.Новая;
		Возврат;
	КонецЕсли;

	Если ВнешнийСтатус = "В работе" Тогда
		ОбъектДокумента.Статус = Перечисления.ИТСервисы_СтатусыЗадач.ВРаботе;
		Возврат;
	КонецЕсли;

	Если ВнешнийСтатус = "На проверке" Тогда
		ОбъектДокумента.Статус = Перечисления.ИТСервисы_СтатусыЗадач.НаПроверке;
		Возврат;
	КонецЕсли;

	Если ВнешнийСтатус = "Готово" Тогда
		ОбъектДокумента.Статус = Перечисления.ИТСервисы_СтатусыЗадач.Завершена;
		Возврат;
	КонецЕсли;

	Если ВнешнийСтатус = "Отменено" Тогда
		ОбъектДокумента.Статус = Перечисления.ИТСервисы_СтатусыЗадач.Отменена;
		Возврат;
	КонецЕсли;

КонецПроцедуры


Функция ПолучитьИзмененныеЗадачи() Экспорт

	МассивЗадач = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИТСервисы_Задачи КАК Док";
	// ИЗМЕНЕНО: Убрали условие ГДЕ НЕ Док.ПометкаУдаления

	ВыборкаДокументов = Запрос.Выполнить().Выбрать();

	Пока ВыборкаДокументов.Следующий() Цикл

		ОбъектДокумента = ВыборкаДокументов.Ссылка.ПолучитьОбъект();

		// ИЗМЕНЕНО: Убрали проверку ОбъектДокумента.ПометкаУдаления Тогда Продолжить

		Для Каждого СтрокаЗадачи Из ОбъектДокумента.ИнтеграционныйКонтур Цикл

			Если НЕ НужноВыгружатьСтроку(СтрокаЗадачи) Тогда
				Продолжить;
			КонецЕсли;

			Стр = Новый Структура;
			Стр.Вставить("document_ref", Строка(ОбъектДокумента.Ссылка.УникальныйИдентификатор()));
			Стр.Вставить("row_number", СтрокаЗадачи.НомерСтроки);
			Стр.Вставить("uuid", БезопаснаяСтрока(СтрокаЗадачи.UUIDСтроки));
			
			Стр.Вставить("title", ПолучитьЗаголовокЗадачи(ОбъектДокумента));
			Стр.Вставить("description", БезопаснаяСтрока(ОбъектДокумента.Описание));
			Стр.Вставить("start_date", ФорматДатаВJSON(ОбъектДокумента.ДатаНачала));
			Стр.Вставить("end_date", ФорматДатаВJSON(ОбъектДокумента.ДатаОкончания));
			Стр.Вставить("planned_hours", ОбъектДокумента.ПлановаяТрудоемкость);
			Стр.Вставить("actual_hours", ОбъектДокумента.ФактическаяТрудоемкость);
			Стр.Вставить("project", БезопаснаяСтрока(ОбъектДокумента.Проект)); 
			
			Стр.Вставить("assignee", БезопаснаяСтрока(ОбъектДокумента.Исполнитель));
			Стр.Вставить("owner", БезопаснаяСтрока(ОбъектДокумента.Ответственный));
			
			Стр.Вставить("status", БезопаснаяСтрока(ОбъектДокумента.Статус));
			Стр.Вставить("priority", БезопаснаяСтрока(ОбъектДокумента.Приоритет));

			Стр.Вставить("is_deleted", ОбъектДокумента.ПометкаУдаления);

			Стр.Вставить("kaiten_id", БезопаснаяСтрока(СтрокаЗадачи.KaitenID));
			Стр.Вставить("external_status", БезопаснаяСтрока(СтрокаЗадачи.ВнешнийСтатус));
			Стр.Вставить("kaiten_card_url", БезопаснаяСтрока(СтрокаЗадачи.KaitenCardURL));
			
			МассивЗадач.Добавить(Стр);

		КонецЦикла;

	КонецЦикла;

	Возврат МассивЗадач;

КонецФункции


Функция ОбновитьПоляСинхронизации(Данные) Экспорт

	UUIDСтроки = "";
	KaitenID = "";
	ВнешнийСтатус = "";
	KaitenCardURL = "";

	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Данные.Свойство("uuid", UUIDСтроки);
		Данные.Свойство("kaiten_id", KaitenID);
		Данные.Свойство("external_status", ВнешнийСтатус);
		Данные.Свойство("kaiten_card_url", KaitenCardURL);
	КонецЕсли;

	UUIDСтроки = БезопаснаяСтрока(UUIDСтроки);
	KaitenID = БезопаснаяСтрока(KaitenID);
	ВнешнийСтатус = БезопаснаяСтрока(ВнешнийСтатус);
	KaitenCardURL = БезопаснаяСтрока(KaitenCardURL);

	Если ПустаяСтрока(UUIDСтроки) Тогда
		ВызватьИсключение "Не передан uuid";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таб.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИТСервисы_Задачи.ИнтеграционныйКонтур КАК Таб
	|ГДЕ
	|	Таб.UUIDСтроки ПОДОБНО &UUIDСтроки";
	
	Запрос.УстановитьПараметр("UUIDСтроки", UUIDСтроки);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();

		Для Каждого СтрокаЗадачи Из ОбъектДокумента.ИнтеграционныйКонтур Цикл
			Если БезопаснаяСтрока(СтрокаЗадачи.UUIDСтроки) = UUIDСтроки Тогда
				СтрокаЗадачи.KaitenID = KaitenID;
				СтрокаЗадачи.ВнешнийСтатус = ВнешнийСтатус;
				СтрокаЗадачи.KaitenCardURL = KaitenCardURL;
				СтрокаЗадачи.ИзмененПослеСинхронизации = Ложь;
				СтрокаЗадачи.ДатаПоследнейСинхронизации = ТекущаяДата();

				ЗаписатьДокументТехнически(ОбъектДокумента);
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция СоздатьИлиОбновитьЗадачуИзKaiten(Данные) Экспорт

	KaitenID = "";
	ВнешнийСтатус = "";
	ВнешнийПриоритет = "";
	KaitenCardURL = "";
	Заголовок = "";
	UUIDСтроки = "";
	ФактическаяТрудоемкость = 0;

	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Данные.Свойство("kaiten_id", KaitenID);
		Данные.Свойство("external_status", ВнешнийСтатус);
		Данные.Свойство("external_priority", ВнешнийПриоритет);
		Данные.Свойство("kaiten_card_url", KaitenCardURL);
		Данные.Свойство("title", Заголовок);
		Данные.Свойство("uuid", UUIDСтроки);
		Данные.Свойство("actual_hours", ФактическаяТрудоемкость);
	КонецЕсли;

	KaitenID = БезопаснаяСтрока(KaitenID);
	ВнешнийСтатус = БезопаснаяСтрока(ВнешнийСтатус);
	ВнешнийПриоритет = БезопаснаяСтрока(ВнешнийПриоритет);
	KaitenCardURL = БезопаснаяСтрока(KaitenCardURL);
	Заголовок = БезопаснаяСтрока(Заголовок);
	UUIDСтроки = БезопаснаяСтрока(UUIDСтроки);

	Если ПустаяСтрока(KaitenID) И ПустаяСтрока(UUIDСтроки) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таб.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИТСервисы_Задачи.ИнтеграционныйКонтур КАК Таб
	|ГДЕ
	|	Таб.KaitenID ПОДОБНО &KaitenID 
	|	ИЛИ Таб.UUIDСтроки ПОДОБНО &UUIDСтроки";
	
	Запрос.УстановитьПараметр("KaitenID", KaitenID);
	Запрос.УстановитьПараметр("UUIDСтроки", UUIDСтроки);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();

		Для Каждого СтрокаЗадачи Из ОбъектДокумента.ИнтеграционныйКонтур Цикл

			НайденаСтрока = Ложь;

			Если НЕ ПустаяСтрока(KaitenID) И БезопаснаяСтрока(СтрокаЗадачи.KaitenID) = KaitenID Тогда
				НайденаСтрока = Истина;
			КонецЕсли;

			Если НЕ НайденаСтрока И НЕ ПустаяСтрока(UUIDСтроки) И БезопаснаяСтрока(СтрокаЗадачи.UUIDСтроки) = UUIDСтроки Тогда
				НайденаСтрока = Истина;
			КонецЕсли;

			Если НЕ НайденаСтрока Тогда
				Продолжить;
			КонецЕсли;

			Если НЕ ПустаяСтрока(KaitenID) Тогда
				СтрокаЗадачи.KaitenID = KaitenID;
			КонецЕсли;

			Если НЕ ПустаяСтрока(ВнешнийСтатус) Тогда
				СтрокаЗадачи.ВнешнийСтатус = ВнешнийСтатус;
			КонецЕсли;

			Если НЕ ПустаяСтрока(KaitenCardURL) Тогда
				СтрокаЗадачи.KaitenCardURL = KaitenCardURL;
			КонецЕсли;

			Если НЕ ПустаяСтрока(Заголовок) Тогда
				ОбъектДокумента.Описание = Заголовок;
			КонецЕсли;

			Если ЗначениеЗаполнено(ФактическаяТрудоемкость) Тогда
				ОбъектДокумента.ФактическаяТрудоемкость = ФактическаяТрудоемкость;
			КонецЕсли;

			ПопытатьсяЗаполнитьСтатус1СИзВнешнегоСтатуса(ОбъектДокумента, ВнешнийСтатус);
			ПопытатьсяЗаполнитьПриоритет1СИзВнешнего(ОбъектДокумента, ВнешнийПриоритет);

			СтрокаЗадачи.ДатаПоследнейСинхронизации = ТекущаяДата();
			СтрокаЗадачи.ИзмененПослеСинхронизации = Ложь;

			ЗаписатьДокументСПроведением(ОбъектДокумента);

			Возврат БезопаснаяСтрока(СтрокаЗадачи.UUIDСтроки);

		КонецЦикла;
	КонецЕсли;

	Возврат "";

КонецФункции


Процедура ПопытатьсяЗаполнитьПриоритет1СИзВнешнего(ОбъектДокумента, ВнешнийПриоритет) Экспорт
	ВнешнийПриоритет = Врег(БезопаснаяСтрока(ВнешнийПриоритет));
	Если ПустаяСтрока(ВнешнийПриоритет) Тогда 
		Возврат; 
	КонецЕсли;

	Если Найти(ВнешнийПриоритет, "НИЗКИЙ") > 0 Тогда
		ОбъектДокумента.Приоритет = Перечисления.ИТСервисы_ПриоритетыЗадач.Низкий;
	ИначеЕсли Найти(ВнешнийПриоритет, "СРЕДНИЙ") > 0 Тогда
		ОбъектДокумента.Приоритет = Перечисления.ИТСервисы_ПриоритетыЗадач.Средний;
	ИначеЕсли Найти(ВнешнийПриоритет, "ВЫСОКИЙ") > 0 Тогда
		ОбъектДокумента.Приоритет = Перечисления.ИТСервисы_ПриоритетыЗадач.Высокий;
	ИначеЕсли Найти(ВнешнийПриоритет, "КРИТИЧЕСКИЙ") > 0 Тогда
		ОбъектДокумента.Приоритет = Перечисления.ИТСервисы_ПриоритетыЗадач.Критический;
	КонецЕсли;
КонецПроцедуры


Процедура ИсправитьДублиUUID() Экспорт

	ВстреченныеUUID = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИТСервисы_Задачи КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления";

	ВыборкаДокументов = Запрос.Выполнить().Выбрать();

	Пока ВыборкаДокументов.Следующий() Цикл

		ОбъектДокумента = ВыборкаДокументов.Ссылка.ПолучитьОбъект();

		Если ОбъектДокумента.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;

		НужноЗаписать = Ложь;

		Для Каждого СтрокаЗадачи Из ОбъектДокумента.ИнтеграционныйКонтур Цикл

			ТекущийUUID = БезопаснаяСтрока(СтрокаЗадачи.UUIDСтроки);

			Если ПустаяСтрока(ТекущийUUID) Тогда
				СтрокаЗадачи.Задача = Строка(Новый УникальныйИдентификатор());
				СтрокаЗадачи.ИзмененПослеСинхронизации = Истина;
				НужноЗаписать = Истина;
				Продолжить;
			КонецЕсли;

			Если ВстреченныеUUID.Получить(ТекущийUUID) <> Неопределено Тогда
				СтрокаЗадачи.Задача = Строка(Новый УникальныйИдентификатор());
				СтрокаЗадачи.ИзмененПослеСинхронизации = Истина;
				НужноЗаписать = Истина;
			Иначе
				ВстреченныеUUID.Вставить(ТекущийUUID, Истина);
			КонецЕсли;

		КонецЦикла;

		Если НужноЗаписать Тогда
			ЗаписатьДокументТехнически(ОбъектДокумента);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ИнициализироватьНастройкиИнтеграцииKaitenПоПроектам() Экспорт

	УникальныеПроекты = Новый Соответствие;
	СуществующиеНастройки = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИТСервисы_Задачи КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления";

	ВыборкаДокументов = Запрос.Выполнить().Выбрать();

	Пока ВыборкаДокументов.Следующий() Цикл

		ОбъектДокумента = ВыборкаДокументов.Ссылка.ПолучитьОбъект();

		Если ОбъектДокумента.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		// Исправлено: Читаем проект из шапки
		Если НЕ ЗначениеЗаполнено(ОбъектДокумента.Проект) Тогда
			Продолжить;
		КонецЕсли;
		
		КлючПроекта = Строка(ОбъектДокумента.Проект.УникальныйИдентификатор());
		
		Если УникальныеПроекты.Получить(КлючПроекта) = Неопределено Тогда
			УникальныеПроекты.Вставить(КлючПроекта, ОбъектДокумента.Проект);
		КонецЕсли;

	КонецЦикла;

	ЗапросНастроек = Новый Запрос;
	ЗапросНастроек.Текст =
	"ВЫБРАТЬ
	|	Настройки.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.ИТСервисы_НастройкиИнтеграцииKaiten КАК Настройки
	|ГДЕ
	|	Настройки.ExternalSystemCode = &ExternalSystemCode
	|	ИЛИ Настройки.ExternalSystemCode = &EmptyCode";

	ЗапросНастроек.УстановитьПараметр("ExternalSystemCode", "KAITEN");
	ЗапросНастроек.УстановитьПараметр("EmptyCode", "");

	ВыборкаНастроек = ЗапросНастроек.Выполнить().Выбрать();

	Пока ВыборкаНастроек.Следующий() Цикл
		КлючПроекта = Строка(ВыборкаНастроек.Проект.УникальныйИдентификатор());
		СуществующиеНастройки.Вставить(КлючПроекта, Истина);
	КонецЦикла;

	НаборЗаписей = РегистрыСведений.ИТСервисы_НастройкиИнтеграцииKaiten.СоздатьНаборЗаписей();

	Для Каждого ЭлементПроекта Из УникальныеПроекты Цикл

		КлючПроекта = ЭлементПроекта.Ключ;
		ИТПроект = ЭлементПроекта.Значение;

		Если СуществующиеНастройки.Получить(КлючПроекта) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Проект = ИТПроект; 
		НоваяЗапись.Активно = Ложь;
		НоваяЗапись.KaitenBoardID = 0;
		НоваяЗапись.KaitenLaneID = 0;
		НоваяЗапись.KaitenQueueColumnID = 0;
		НоваяЗапись.KaitenInProgressColumnID = 0;
		НоваяЗапись.KaitenReviewColumnID = 0;
		НоваяЗапись.KaitenDoneColumnID = 0;
		НоваяЗапись.KaitenCanceledColumnID = 0;
		НоваяЗапись.PriorityPropertyID = 0;
		НоваяЗапись.PlanHoursPropertyID = 0;
		НоваяЗапись.FactHoursPropertyID = 0;
		НоваяЗапись.ProjectPropertyID = 0; 
		НоваяЗапись.StartDatePropertyID = 0;
		НоваяЗапись.EndDatePropertyID = 0;
		НоваяЗапись.ExternalSystemCode = "KAITEN";

	КонецЦикла;

	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьНастройкиИнтеграцииKaiten() Экспорт

	ИнициализироватьНастройкиИнтеграцииKaitenПоПроектам();

	РезультатПоПроектам = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Проект КАК Проект,
	|	Настройки.Проект.Наименование КАК ИмяПроекта, 
	|	Настройки.Активно КАК Активно,
	|	Настройки.KaitenBoardID КАК KaitenBoardID,
	|	Настройки.KaitenLaneID КАК KaitenLaneID,
	|	Настройки.KaitenQueueColumnID КАК KaitenQueueColumnID,
	|	Настройки.KaitenInProgressColumnID КАК KaitenInProgressColumnID,
	|	Настройки.KaitenReviewColumnID КАК KaitenReviewColumnID,
	|	Настройки.KaitenDoneColumnID КАК KaitenDoneColumnID,
	|	Настройки.KaitenCanceledColumnID КАК KaitenCanceledColumnID,
	|	Настройки.PriorityPropertyID КАК PriorityPropertyID,
	|	Настройки.PlanHoursPropertyID КАК PlanHoursPropertyID,
	|	Настройки.FactHoursPropertyID КАК FactHoursPropertyID,
	|	Настройки.ProjectPropertyID КАК ProjectPropertyID, 
	|	Настройки.StartDatePropertyID КАК StartDatePropertyID,
	|	Настройки.EndDatePropertyID КАК EndDatePropertyID,
	|	Настройки.ExternalSystemCode КАК ExternalSystemCode
	|ИЗ
	|	РегистрСведений.ИТСервисы_НастройкиИнтеграцииKaiten КАК Настройки
	|ГДЕ
	|	Настройки.ExternalSystemCode = &ExternalSystemCode
	|	ИЛИ Настройки.ExternalSystemCode = &EmptyCode";
	
	Запрос.УстановитьПараметр("ExternalSystemCode", "KAITEN");
	Запрос.УстановитьПараметр("EmptyCode", "");

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		КлючПроекта = Строка(Выборка.Проект.УникальныйИдентификатор());

		Стр = Новый Структура;
		Стр.Вставить("project_ref", КлючПроекта);
		Стр.Вставить("project_name", БезопаснаяСтрока(Выборка.ИмяПроекта));
		Стр.Вставить("active", Выборка.Активно);
		Стр.Вставить("board_id", Выборка.KaitenBoardID);
		Стр.Вставить("lane_id", Выборка.KaitenLaneID);
		Стр.Вставить("_external_system_code", БезопаснаяСтрока(Выборка.ExternalSystemCode));

		Колонки = Новый Структура;
		Колонки.Вставить("queue", Выборка.KaitenQueueColumnID);
		Колонки.Вставить("in_progress", Выборка.KaitenInProgressColumnID);
		Колонки.Вставить("review", Выборка.KaitenReviewColumnID);
		Колонки.Вставить("done", Выборка.KaitenDoneColumnID);
		Колонки.Вставить("canceled", Выборка.KaitenCanceledColumnID);
		Стр.Вставить("columns", Колонки);

		Свойства = Новый Структура;
		Свойства.Вставить("priority", Выборка.PriorityPropertyID);
		Свойства.Вставить("plan_hours", Выборка.PlanHoursPropertyID);
		Свойства.Вставить("fact_hours", Выборка.FactHoursPropertyID);
		Свойства.Вставить("project", Выборка.ProjectPropertyID); 
		Свойства.Вставить("start_date", Выборка.StartDatePropertyID);
		Свойства.Вставить("end_date", Выборка.EndDatePropertyID);
		Стр.Вставить("properties", Свойства);

		СуществующаяСтрока = РезультатПоПроектам.Получить(КлючПроекта);

		Если СуществующаяСтрока = Неопределено Тогда
			РезультатПоПроектам.Вставить(КлючПроекта, Стр);
			Продолжить;
		КонецЕсли;

		Если ПустаяСтрока(БезопаснаяСтрока(СуществующаяСтрока._external_system_code))
			И НЕ ПустаяСтрока(БезопаснаяСтрока(Стр._external_system_code)) Тогда
			РезультатПоПроектам.Вставить(КлючПроекта, Стр);
		КонецЕсли;

	КонецЦикла;

	Результат = Новый Массив;

	Для Каждого Элемент Из РезультатПоПроектам Цикл
		Стр = Элемент.Значение;
		Стр.Удалить("_external_system_code");
		Результат.Добавить(Стр);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ОбновитьНастройкиИнтеграцииKaiten(СписокНастроек) Экспорт

	Если ТипЗнч(СписокНастроек) <> Тип("Массив") Тогда
		ВызватьИсключение "Ожидался массив настроек";
	КонецЕсли;

	Для Каждого Элемент Из СписокНастроек Цикл

		Если ТипЗнч(Элемент) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;

		ProjectRef = Неопределено; 
		Active = Ложь;
		BoardID = 0;
		LaneID = 0;
		Columns = Неопределено;
		Properties = Неопределено;

		Элемент.Свойство("project_ref", ProjectRef);
		Элемент.Свойство("active", Active);
		Элемент.Свойство("board_id", BoardID);
		Элемент.Свойство("lane_id", LaneID);
		Элемент.Свойство("columns", Columns);
		Элемент.Свойство("properties", Properties);

		Если НЕ ЗначениеЗаполнено(ProjectRef) Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			СсылкаПроекта = Справочники.ИТСервисы_Проекты.ПолучитьСсылку(Новый УникальныйИдентификатор(ProjectRef));
		Исключение
			Продолжить;
		КонецПопытки;

		Если НЕ ЗначениеЗаполнено(СсылкаПроекта) Тогда
			Продолжить;
		КонецЕсли;

		НаборЗаписей = РегистрыСведений.ИТСервисы_НастройкиИнтеграцииKaiten.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Проект.Установить(СсылкаПроекта);
		НаборЗаписей.Прочитать();

		Если НаборЗаписей.Количество() = 0 Тогда
		    НоваяЗапись = НаборЗаписей.Добавить();
		    НоваяЗапись.Проект = СсылкаПроекта;
		Иначе
		    НоваяЗапись = НаборЗаписей[0];
		КонецЕсли;

		НоваяЗапись.ExternalSystemCode = "KAITEN";

		НоваяЗапись.Активно = Active;
		НоваяЗапись.KaitenBoardID = BoardID;
		НоваяЗапись.KaitenLaneID = LaneID;

		Если ТипЗнч(Columns) = Тип("Структура") Тогда
			QueueID = 0;
			InProgressID = 0;
			ReviewID = 0;
			DoneID = 0;
			CanceledID = 0;

			Columns.Свойство("queue", QueueID);
			Columns.Свойство("in_progress", InProgressID);
			Columns.Свойство("review", ReviewID);
			Columns.Свойство("done", DoneID);
			Columns.Свойство("canceled", CanceledID);

			НоваяЗапись.KaitenQueueColumnID = QueueID;
			НоваяЗапись.KaitenInProgressColumnID = InProgressID;
			НоваяЗапись.KaitenReviewColumnID = ReviewID;
			НоваяЗапись.KaitenDoneColumnID = DoneID;
			НоваяЗапись.KaitenCanceledColumnID = CanceledID;
		КонецЕсли;

		Если ТипЗнч(Properties) = Тип("Структура") Тогда
			PriorityID = 0;
			PlanHoursID = 0;
			FactHoursID = 0;
			ProjectPropertyID = 0; 
			StartDateID = 0;
			EndDateID = 0;

			Properties.Свойство("priority", PriorityID);
			Properties.Свойство("plan_hours", PlanHoursID);
			Properties.Свойство("fact_hours", FactHoursID);
			Properties.Свойство("project", ProjectPropertyID); 
			Properties.Свойство("start_date", StartDateID);
			Properties.Свойство("end_date", EndDateID);

			НоваяЗапись.PriorityPropertyID = PriorityID;
			НоваяЗапись.PlanHoursPropertyID = PlanHoursID;
			НоваяЗапись.FactHoursPropertyID = FactHoursID;
			НоваяЗапись.ProjectPropertyID = ProjectPropertyID; 
			НоваяЗапись.StartDatePropertyID = StartDateID;
			НоваяЗапись.EndDatePropertyID = EndDateID;
		КонецЕсли;

		НаборЗаписей.Записать();

	КонецЦикла;

	Возврат Истина;

КонецФункции
